grit-li/stm32-platform-lib/src/stm32-platform/hw/hw_rcc.h
#ifndef __SETM32_PLATFORM_HW_RCC_H__
#define __SETM32_PLATFORM_HW_RCC_H__

#include <stdint.h>
#include "cortex_m.h"
#include "stm32_hw_reg_map.h"
#include "stm32_bitops.h"

#ifdef __cplusplus
extern "C" {
#endif

struct RCC_TypeDef
{
    __IO uint32_t CR;          /*!< RCC clock control register,                                              Address offset: 0x00 */
    __IO uint32_t ICSCR;       /*!< RCC internal clock sources calibration register,                         Address offset: 0x04 */
    __IO uint32_t CFGR;        /*!< RCC clock configuration register,                                        Address offset: 0x08 */
    __IO uint32_t PLLCFGR;     /*!< RCC system PLL configuration register,                                   Address offset: 0x0C */
    __IO uint32_t PLLSAI1CFGR; /*!< RCC PLL SAI1 configuration register,                                     Address offset: 0x10 */
    __IO uint32_t PLLSAI2CFGR; /*!< RCC PLL SAI2 configuration register,                                     Address offset: 0x14 */
    __IO uint32_t CIER;        /*!< RCC clock interrupt enable register,                                     Address offset: 0x18 */
    __IO uint32_t CIFR;        /*!< RCC clock interrupt flag register,                                       Address offset: 0x1C */
    __IO uint32_t CICR;        /*!< RCC clock interrupt clear register,                                      Address offset: 0x20 */
    uint32_t      RESERVED0;   /*!< Reserved,                                                                Address offset: 0x24 */
    __IO uint32_t AHB1RSTR;    /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x28 */
    __IO uint32_t AHB2RSTR;    /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x2C */
    __IO uint32_t AHB3RSTR;    /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x30 */
    uint32_t      RESERVED1;   /*!< Reserved,                                                                Address offset: 0x34 */
    __IO uint32_t APB1RSTR1;   /*!< RCC APB1 peripheral reset register 1,                                    Address offset: 0x38 */
    __IO uint32_t APB1RSTR2;   /*!< RCC APB1 peripheral reset register 2,                                    Address offset: 0x3C */
    __IO uint32_t APB2RSTR;    /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x40 */
    uint32_t      RESERVED2;   /*!< Reserved,                                                                Address offset: 0x44 */
    __IO uint32_t AHB1ENR;     /*!< RCC AHB1 peripheral clocks enable register,                              Address offset: 0x48 */
    __IO uint32_t AHB2ENR;     /*!< RCC AHB2 peripheral clocks enable register,                              Address offset: 0x4C */
    __IO uint32_t AHB3ENR;     /*!< RCC AHB3 peripheral clocks enable register,                              Address offset: 0x50 */
    uint32_t      RESERVED3;   /*!< Reserved,                                                                Address offset: 0x54 */
    __IO uint32_t APB1ENR1;    /*!< RCC APB1 peripheral clocks enable register 1,                            Address offset: 0x58 */
    __IO uint32_t APB1ENR2;    /*!< RCC APB1 peripheral clocks enable register 2,                            Address offset: 0x5C */
    __IO uint32_t APB2ENR;     /*!< RCC APB2 peripheral clocks enable register,                              Address offset: 0x60 */
    uint32_t      RESERVED4;   /*!< Reserved,                                                                Address offset: 0x64 */
    __IO uint32_t AHB1SMENR;   /*!< RCC AHB1 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x68 */
    __IO uint32_t AHB2SMENR;   /*!< RCC AHB2 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x6C */
    __IO uint32_t AHB3SMENR;   /*!< RCC AHB3 peripheral clocks enable in sleep and stop modes register,      Address offset: 0x70 */
    uint32_t      RESERVED5;   /*!< Reserved,                                                                Address offset: 0x74 */
    __IO uint32_t APB1SMENR1;  /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1, Address offset: 0x78 */
    __IO uint32_t APB1SMENR2;  /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2, Address offset: 0x7C */
    __IO uint32_t APB2SMENR;   /*!< RCC APB2 peripheral clocks enable in sleep mode and stop modes register, Address offset: 0x80 */
    uint32_t      RESERVED6;   /*!< Reserved,                                                                Address offset: 0x84 */
    __IO uint32_t CCIPR;       /*!< RCC peripherals independent clock configuration register,                Address offset: 0x88 */
    uint32_t      RESERVED7;   /*!< Reserved,                                                                Address offset: 0x8C */
    __IO uint32_t BDCR;        /*!< RCC backup domain control register,                                      Address offset: 0x90 */
    __IO uint32_t CSR;         /*!< RCC clock control & status register,                                     Address offset: 0x94 */
};

#define RCC                 ((struct RCC_TypeDef *) RCC_BASE)
static inline struct RCC_TypeDef* __GET_RCC_REGISTER__(void)
{
    return RCC;
}

#define __GET_RCC_CR__          (__GET_RCC_REGISTER__()->CR)
#define __GET_RCC_ICSCR__       (__GET_RCC_REGISTER__()->ICSCR)
#define __GET_RCC_CFGR__        (__GET_RCC_REGISTER__()->CFGR)
#define __GET_RCC_PLLCFGR__     (__GET_RCC_REGISTER__()->PLLCFGR)
#define __GET_RCC_PLLSAI1CFGR__ (__GET_RCC_REGISTER__()->PLLSAI1CFGR)
#define __GET_RCC_PLLSAI2CFGR__ (__GET_RCC_REGISTER__()->PLLSAI2CFGR)
#define __GET_RCC_CIER__        (__GET_RCC_REGISTER__()->CIER)
#define __GET_RCC_CIFR__        (__GET_RCC_REGISTER__()->CIFR)
#define __GET_RCC_CICR__        (__GET_RCC_REGISTER__()->CICR)
#define __GET_RCC_AHB1RSTR__    (__GET_RCC_REGISTER__()->AHB1RSTR)
#define __GET_RCC_AHB2RSTR__    (__GET_RCC_REGISTER__()->AHB2RSTR)
#define __GET_RCC_AHB3RSTR__    (__GET_RCC_REGISTER__()->AHB3RSTR)
#define __GET_RCC_APB1RSTR1__   (__GET_RCC_REGISTER__()->APB1RSTR1)
#define __GET_RCC_APB1RSTR2__   (__GET_RCC_REGISTER__()->APB1RSTR2)
#define __GET_RCC_APB2RSTR__    (__GET_RCC_REGISTER__()->APB2RSTR)
#define __GET_RCC_AHB1ENR__     (__GET_RCC_REGISTER__()->AHB1ENR)
#define __GET_RCC_AHB2ENR__     (__GET_RCC_REGISTER__()->AHB2ENR)
#define __GET_RCC_AHB3ENR__     (__GET_RCC_REGISTER__()->AHB3ENR)
#define __GET_RCC_APB1ENR1__    (__GET_RCC_REGISTER__()->APB1ENR1)
#define __GET_RCC_APB1ENR2__    (__GET_RCC_REGISTER__()->APB1ENR2)
#define __GET_RCC_APB2ENR__     (__GET_RCC_REGISTER__()->APB2ENR)
#define __GET_RCC_AHB1SMENR__   (__GET_RCC_REGISTER__()->AHB1SMENR)
#define __GET_RCC_AHB2SMENR__   (__GET_RCC_REGISTER__()->AHB2SMENR)
#define __GET_RCC_AHB3SMENR__   (__GET_RCC_REGISTER__()->AHB3SMENR)
#define __GET_RCC_APB1SMENR1__  (__GET_RCC_REGISTER__()->APB1SMENR1)
#define __GET_RCC_APB1SMENR2__  (__GET_RCC_REGISTER__()->APB1SMENR2)
#define __GET_RCC_APB2SMENR__   (__GET_RCC_REGISTER__()->APB2SMENR)
#define __GET_RCC_CCIPR__       (__GET_RCC_REGISTER__()->CCIPR)
#define __GET_RCC_BDCR__        (__GET_RCC_REGISTER__()->BDCR)
#define __GET_RCC_CSR__         (__GET_RCC_REGISTER__()->CSR)

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions  (not present on all devices in the STM32L4 serie)
*/
#define RCC_PLLSAI1_SUPPORT
#define RCC_PLLP_SUPPORT
#define RCC_PLLSAI2_SUPPORT

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_MSION_Pos                     (0U)
#define RCC_CR_MSION_Msk                     (0x1UL << RCC_CR_MSION_Pos)       /*!< 0x00000001 */
#define RCC_CR_MSION                         RCC_CR_MSION_Msk                  /*!< Internal Multi Speed oscillator (MSI) clock enable */
#define RCC_CR_MSIRDY_Pos                    (1U)
#define RCC_CR_MSIRDY_Msk                    (0x1UL << RCC_CR_MSIRDY_Pos)      /*!< 0x00000002 */
#define RCC_CR_MSIRDY                        RCC_CR_MSIRDY_Msk                 /*!< Internal Multi Speed oscillator (MSI) clock ready flag */
#define RCC_CR_MSIPLLEN_Pos                  (2U)
#define RCC_CR_MSIPLLEN_Msk                  (0x1UL << RCC_CR_MSIPLLEN_Pos)    /*!< 0x00000004 */
#define RCC_CR_MSIPLLEN                      RCC_CR_MSIPLLEN_Msk               /*!< Internal Multi Speed oscillator (MSI) PLL enable */
#define RCC_CR_MSIRGSEL_Pos                  (3U)
#define RCC_CR_MSIRGSEL_Msk                  (0x1UL << RCC_CR_MSIRGSEL_Pos)    /*!< 0x00000008 */
#define RCC_CR_MSIRGSEL                      RCC_CR_MSIRGSEL_Msk               /*!< Internal Multi Speed oscillator (MSI) range selection */

/*!< MSIRANGE configuration : 12 frequency ranges available */
#define RCC_CR_MSIRANGE_Pos                  (4U)
#define RCC_CR_MSIRANGE_Msk                  (0xFUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000F0 */
#define RCC_CR_MSIRANGE                      RCC_CR_MSIRANGE_Msk               /*!< Internal Multi Speed oscillator (MSI) clock Range */
#define RCC_CR_MSIRANGE_0                    (0x0UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000000 */
#define RCC_CR_MSIRANGE_1                    (0x1UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000010 */
#define RCC_CR_MSIRANGE_2                    (0x2UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000020 */
#define RCC_CR_MSIRANGE_3                    (0x3UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000030 */
#define RCC_CR_MSIRANGE_4                    (0x4UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000040 */
#define RCC_CR_MSIRANGE_5                    (0x5UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000050 */
#define RCC_CR_MSIRANGE_6                    (0x6UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000060 */
#define RCC_CR_MSIRANGE_7                    (0x7UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000070 */
#define RCC_CR_MSIRANGE_8                    (0x8UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000080 */
#define RCC_CR_MSIRANGE_9                    (0x9UL << RCC_CR_MSIRANGE_Pos)    /*!< 0x00000090 */
#define RCC_CR_MSIRANGE_10                   (0xAUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000A0 */
#define RCC_CR_MSIRANGE_11                   (0xBUL << RCC_CR_MSIRANGE_Pos)    /*!< 0x000000B0 */

#define RCC_CR_HSION_Pos                     (8U)
#define RCC_CR_HSION_Msk                     (0x1UL << RCC_CR_HSION_Pos)       /*!< 0x00000100 */
#define RCC_CR_HSION                         RCC_CR_HSION_Msk                  /*!< Internal High Speed oscillator (HSI16) clock enable */
#define RCC_CR_HSIKERON_Pos                  (9U)
#define RCC_CR_HSIKERON_Msk                  (0x1UL << RCC_CR_HSIKERON_Pos)    /*!< 0x00000200 */
#define RCC_CR_HSIKERON                      RCC_CR_HSIKERON_Msk               /*!< Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel */
#define RCC_CR_HSIRDY_Pos                    (10U)
#define RCC_CR_HSIRDY_Msk                    (0x1UL << RCC_CR_HSIRDY_Pos)      /*!< 0x00000400 */
#define RCC_CR_HSIRDY                        RCC_CR_HSIRDY_Msk                 /*!< Internal High Speed oscillator (HSI16) clock ready flag */
#define RCC_CR_HSIASFS_Pos                   (11U)
#define RCC_CR_HSIASFS_Msk                   (0x1UL << RCC_CR_HSIASFS_Pos)     /*!< 0x00000800 */
#define RCC_CR_HSIASFS                       RCC_CR_HSIASFS_Msk                /*!< HSI16 Automatic Start from Stop */

