grit-li/stm32-platform-lib/src/stm32-platform/hw/hw_rcc.h
#define RCC_BDCR_RTCEN_Pos                   (15U)
#define RCC_BDCR_RTCEN_Msk                   (0x1UL << RCC_BDCR_RTCEN_Pos)     /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                       RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_BDRST_Pos                   (16U)
#define RCC_BDCR_BDRST_Msk                   (0x1UL << RCC_BDCR_BDRST_Pos)     /*!< 0x00010000 */
#define RCC_BDCR_BDRST                       RCC_BDCR_BDRST_Msk
#define RCC_BDCR_LSCOEN_Pos                  (24U)
#define RCC_BDCR_LSCOEN_Msk                  (0x1UL << RCC_BDCR_LSCOEN_Pos)    /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                      RCC_BDCR_LSCOEN_Msk
#define RCC_BDCR_LSCOSEL_Pos                 (25U)
#define RCC_BDCR_LSCOSEL_Msk                 (0x1UL << RCC_BDCR_LSCOSEL_Pos)   /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                     RCC_BDCR_LSCOSEL_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                    (0U)
#define RCC_CSR_LSION_Msk                    (0x1UL << RCC_CSR_LSION_Pos)      /*!< 0x00000001 */
#define RCC_CSR_LSION                        RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos                   (1U)
#define RCC_CSR_LSIRDY_Msk                   (0x1UL << RCC_CSR_LSIRDY_Pos)     /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                       RCC_CSR_LSIRDY_Msk

#define RCC_CSR_MSISRANGE_Pos                (8U)
#define RCC_CSR_MSISRANGE_Msk                (0xFUL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000F00 */
#define RCC_CSR_MSISRANGE                    RCC_CSR_MSISRANGE_Msk
#define RCC_CSR_MSISRANGE_1                  (0x4UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000400 */
#define RCC_CSR_MSISRANGE_2                  (0x5UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000500 */
#define RCC_CSR_MSISRANGE_4                  (0x6UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000600 */
#define RCC_CSR_MSISRANGE_8                  (0x7UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000700 */

#define RCC_CSR_RMVF_Pos                     (23U)
#define RCC_CSR_RMVF_Msk                     (0x1UL << RCC_CSR_RMVF_Pos)       /*!< 0x00800000 */
#define RCC_CSR_RMVF                         RCC_CSR_RMVF_Msk
#define RCC_CSR_FWRSTF_Pos                   (24U)
#define RCC_CSR_FWRSTF_Msk                   (0x1UL << RCC_CSR_FWRSTF_Pos)     /*!< 0x01000000 */
#define RCC_CSR_FWRSTF                       RCC_CSR_FWRSTF_Msk
#define RCC_CSR_OBLRSTF_Pos                  (25U)
#define RCC_CSR_OBLRSTF_Msk                  (0x1UL << RCC_CSR_OBLRSTF_Pos)    /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                      RCC_CSR_OBLRSTF_Msk
#define RCC_CSR_PINRSTF_Pos                  (26U)
#define RCC_CSR_PINRSTF_Msk                  (0x1UL << RCC_CSR_PINRSTF_Pos)    /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                      RCC_CSR_PINRSTF_Msk
#define RCC_CSR_BORRSTF_Pos                  (27U)
#define RCC_CSR_BORRSTF_Msk                  (0x1UL << RCC_CSR_BORRSTF_Pos)    /*!< 0x08000000 */
#define RCC_CSR_BORRSTF                      RCC_CSR_BORRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                  (28U)
#define RCC_CSR_SFTRSTF_Msk                  (0x1UL << RCC_CSR_SFTRSTF_Pos)    /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                      RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos                 (29U)
#define RCC_CSR_IWDGRSTF_Msk                 (0x1UL << RCC_CSR_IWDGRSTF_Pos)   /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                     RCC_CSR_IWDGRSTF_Msk
#define RCC_CSR_WWDGRSTF_Pos                 (30U)
#define RCC_CSR_WWDGRSTF_Msk                 (0x1UL << RCC_CSR_WWDGRSTF_Pos)   /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                     RCC_CSR_WWDGRSTF_Msk
#define RCC_CSR_LPWRRSTF_Pos                 (31U)
#define RCC_CSR_LPWRRSTF_Msk                 (0x1UL << RCC_CSR_LPWRRSTF_Pos)   /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                     RCC_CSR_LPWRRSTF_Msk

void hw_rcc_set_msi_clock_enable(void);
void hw_rcc_set_msi_clock_disable(void);
uint32_t hw_rcc_get_msi_clock_enable(void);
uint32_t hw_rcc_msi_clock_ready_status(void);
void hw_rcc_msi_clock_wait_ready(void);
void hw_rcc_set_msi_clock_pll_enable(void);
void hw_rcc_set_msi_clock_pll_disable(void);
uint32_t hw_rcc_get_msi_clock_pll_enable(void);
void hw_rcc_switch_msi_clock_range(void);
uint32_t hw_rcc_get_msi_clock_range_selection(void);
void hw_rcc_set_msi_clock_ranges(uint32_t range);
uint32_t hw_rcc_get_msi_clock_ranges(void);
void hw_rcc_set_hsi_clock_enable(void);
void hw_rcc_set_hsi_clock_disable(void);
uint32_t hw_rcc_get_hsi_clock_enable(void);
void hw_rcc_set_hsi_clock_enable_for_peripheral_kernels(void);
void hw_rcc_set_hsi_clock_disable_for_peripheral_kernels(void);
uint32_t hw_rcc_get_hsi_clock_enable_for_peripheral_kernels(void);
uint32_t hw_rcc_hsi_clock_ready_status(void);
void hw_rcc_hsi_clock_wait_ready(void);
void hw_rcc_open_hsi_clock_automatic_start_from_stop(void);
void hw_rcc_close_hsi_clock_automatic_start_from_stop(void);
uint32_t hw_rcc_get_hsi_clock_automatic_start_from_stop(void);
void hw_rcc_set_hse_clock_enable(void);
void hw_rcc_set_hse_clock_disable(void);
uint32_t hw_rcc_get_hse_clock_enable(void);
uint32_t hw_rcc_hse_clock_ready_status(void);
void hw_rcc_hse_clock_wait_ready(void);
void hw_rcc_hse_clock_bypass_enadble(void);
void hw_rcc_hse_clock_bypass_disadble(void);
uint32_t hw_rcc_hse_clock_bypass(void);
void hw_rcc_set_clock_security_system_enable(void);
uint32_t hw_rcc_get_clock_security_system_enable(void);
void hw_rcc_set_pll_clock_enable(void);
void hw_rcc_set_pll_clock_disable(void);
uint32_t hw_rcc_get_pll_clock_enable(void);
uint32_t hw_rcc_pll_clock_ready_status(void);
void hw_rcc_pll_clock_wait_ready(void);
void hw_rcc_set_pll_sai1_clock_enable(void);
void hw_rcc_set_pll_sai1_clock_disable(void);
uint32_t hw_rcc_get_pll_sai1_clock_enable(void);
uint32_t hw_rcc_pll_sai1_clock_ready_status(void);
void hw_rcc_pll_sai1_clock_wait_ready(void);
void hw_rcc_set_pll_sai2_clock_enable(void);
void hw_rcc_set_pll_sai2_clock_disable(void);
uint32_t hw_rcc_get_pll_sai2_clock_enable(void);
uint32_t hw_rcc_pll_sai2_clock_ready_status(void);
void hw_rcc_pll_sai2_clock_wait_ready(void);
uint32_t hw_rcc_msi_clock_calibration(void);
void hw_rcc_set_msi_clock_trimming(uint32_t trimming);
uint32_t hw_rcc_get_msi_clock_trimming(void);
uint32_t hw_rcc_hsi_clock_calibration(void);
void hw_rcc_set_hsi_clock_trimming(uint32_t trimming);
uint32_t hw_rcc_get_hsi_clock_trimming(void);
void hw_rcc_set_system_clock_source(uint32_t source);
uint32_t hw_rcc_get_system_clock_source(void);
uint32_t hw_rcc_get_system_clock_source_status(void);
void hw_rcc_set_ahb_clock_prescaler(uint32_t prescaler);
uint32_t hw_rcc_get_ahb_clock_prescaler(void);
void hw_rcc_set_apb1_clock_prescaler(uint32_t prescaler);
uint32_t hw_rcc_get_apb1_clock_prescaler(void);
void hw_rcc_set_apb2_clock_prescaler(uint32_t prescaler);
uint32_t hw_rcc_get_apb2_clock_prescaler(void);
void hw_rcc_select_wakeup_from_stop_css_buckup_clock(uint32_t select);
uint32_t hw_rcc_wakeup_from_stop_css_buckup_clock(void);
void hw_rcc_select_microcontroller_clock_output(uint32_t select);
uint32_t hw_rcc_microcontroller_clock_output(void);
void hw_rcc_set_microcontroller_clock_output_prescaler(uint32_t prescaler);
uint32_t hw_rcc_microcontroller_clock_output_prescaler(void);
void hw_rcc_set_main_clock_source(uint32_t source);
uint32_t hw_rcc_get_main_clock_source(void);
void hw_rcc_set_division_factor_for_main_pll(uint32_t factor);
uint32_t hw_rcc_get_division_factor_for_main_pll(void);
void hw_rcc_set_multiplication_factor_for_main_pll(uint32_t factor);
uint32_t hw_rcc_get_multiplication_factor_for_main_pll(void);
void hw_rcc_set_main_pll_sai3_clock_output_enable(void);
void hw_rcc_set_main_pll_sai3_clock_output_disable(void);
uint32_t hw_rcc_get_main_pll_sai3_clock_output_enable(void);
void hw_rcc_set_main_pll_division_factor_for_pllsai3clk(uint32_t factor);
uint32_t hw_rcc_get_main_pll_division_factor_for_pllsai3clk(void);
void hw_rcc_set_main_pll_pll48m1_clock_output_enable(void);
void hw_rcc_set_main_pll_pll48m1_clock_output_disable(void);
uint32_t hw_rcc_get_main_pll_pll48m1_clock_output_enable(void);
void hw_rcc_set_main_pll_pll48m1_division_factor(uint32_t factor);
uint32_t hw_rcc_get_main_pll_pll48m1_division_factor(void);
void hw_rcc_set_main_pll_clock_output_enable(void);
void hw_rcc_set_main_pll_clock_output_disable(void);
uint32_t hw_rcc_get_main_pll_clock_output_enable(void);
void hw_rcc_set_main_pll_division_factor_for_pllclk(uint32_t factor);
uint32_t hw_rcc_get_main_pll_division_factor_for_pllclk(void);
void hw_rcc_set_pll_sai1_multiplication_factor_for_vco(uint32_t factor);
uint32_t hw_rcc_get_pll_sai1_multiplication_factor_for_vco(void);
void hw_rcc_set_pll_sai1_pllsai1clk_enable(void);
void hw_rcc_set_pll_sai1_pllsai1clk_disable(void);
uint32_t hw_rcc_get_pll_sai1_pllsai1clk_enable(void);
void hw_rcc_set_pll_sai1_division_factor_for_pllsai1clk(uint32_t factor);
uint32_t hw_rcc_get_pll_sai1_division_factor_for_pllsai1clk(void);
void hw_rcc_set_pll_sai1_pll48m2clk_output_enable(void);
void hw_rcc_set_pll_sai1_pll48m2clk_output_disable(void);
uint32_t hw_rcc_get_pll_sai1_pll48m2clk_output_enable(void);
void hw_rcc_set_pll_sai1_division_factor_for_pll48m2clk(uint32_t factor);
uint32_t hw_rcc_get_pll_sai1_division_factor_for_pll48m2clk(void);
void hw_rcc_set_pll_sai1_plladc1clk_output_enable(void);
void hw_rcc_set_pll_sai1_plladc1clk_output_disable(void);
uint32_t hw_rcc_get_pll_sai1_plladc1clk_output_enable(void);
void hw_rcc_set_pll_sai1_division_factor_for_plladc1clk(uint32_t factor);
uint32_t hw_rcc_get_pll_sai1_division_factor_for_plladc1clk(void);
void hw_rcc_set_pll_sai2_multiplication_factor_for_vco(uint32_t factor);
uint32_t hw_rcc_get_pll_sai2_multiplication_factor_for_vco(void);
void hw_rcc_set_pll_sai2_pllsai2clk_enable(void);
void hw_rcc_set_pll_sai2_pllsai2clk_disable(void);
uint32_t hw_rcc_get_pll_sai2_pllsai2clk_enable(void);
void hw_rcc_set_pll_sai2_division_factor_for_pllsai2clk(uint32_t factor);
uint32_t hw_rcc_get_pll_sai2_division_factor_for_pllsai2clk(void);
void hw_rcc_set_pll_sai2_plladc2clk_output_enable(void);
void hw_rcc_set_pll_sai2_plladc2clk_output_disable(void);
uint32_t hw_rcc_get_pll_sai2_plladc2clk_output_enable(void);
void hw_rcc_set_pll_sai2_division_factor_for_plladc2clk(uint32_t factor);
uint32_t hw_rcc_get_pll_sai2_division_factor_for_plladc2clk(void);
void hw_rcc_set_lsi_ready_interrupt_enable(void);
void hw_rcc_set_lsi_ready_interrupt_disable(void);
uint32_t hw_rcc_get_lsi_ready_interrupt_enable(void);
void hw_rcc_set_lse_ready_interrupt_enable(void);
void hw_rcc_set_lse_ready_interrupt_disable(void);
uint32_t hw_rcc_get_lse_ready_interrupt_enable(void);
void hw_rcc_set_msi_ready_interrupt_enable(void);
void hw_rcc_set_msi_ready_interrupt_disable(void);
uint32_t hw_rcc_get_msi_ready_interrupt_enable(void);
void hw_rcc_set_hsi_ready_interrupt_enable(void);
void hw_rcc_set_hsi_ready_interrupt_disable(void);
uint32_t hw_rcc_get_hsi_ready_interrupt_enable(void);
void hw_rcc_set_hse_ready_interrupt_enable(void);
void hw_rcc_set_hse_ready_interrupt_disable(void);
uint32_t hw_rcc_get_hse_ready_interrupt_enable(void);
void hw_rcc_set_pll_ready_interrupt_enable(void);
void hw_rcc_set_pll_ready_interrupt_disable(void);
uint32_t hw_rcc_get_pll_ready_interrupt_enable(void);
void hw_rcc_set_pllsai1_ready_interrupt_enable(void);
void hw_rcc_set_pllsai1_ready_interrupt_disable(void);
uint32_t hw_rcc_get_pllsai1_ready_interrupt_enable(void);
void hw_rcc_set_pllsai2_ready_interrupt_enable(void);
void hw_rcc_set_pllsai2_ready_interrupt_disable(void);
uint32_t hw_rcc_get_pllsai2_ready_interrupt_enable(void);
void hw_rcc_set_lse_css_ready_interrupt_enable(void);
void hw_rcc_set_lse_css_ready_interrupt_disable(void);
uint32_t hw_rcc_lsi_ready_interrupt_flag(void);
uint32_t hw_rcc_lse_ready_interrupt_flag(void);
uint32_t hw_rcc_msi_ready_interrupt_flag(void);
uint32_t hw_rcc_hsi_ready_interrupt_flag(void);
uint32_t hw_rcc_hse_ready_interrupt_flag(void);
uint32_t hw_rcc_pll_ready_interrupt_flag(void);
uint32_t hw_rcc_pll_sai1_ready_interrupt_flag(void);
uint32_t hw_rcc_pll_sai2_ready_interrupt_flag(void);
uint32_t hw_rcc_css_interrupt_flag(void);
uint32_t hw_rcc_lse_css_interrupt_flag(void);
void hw_rcc_clear_lsi_ready_interrupt_flag(void);
void hw_rcc_clear_lse_ready_interrupt_flag(void);
void hw_rcc_clear_msi_ready_interrupt_flag(void);
void hw_rcc_clear_hsi_ready_interrupt_flag(void);
void hw_rcc_clear_hse_ready_interrupt_flag(void);
void hw_rcc_clear_pll_ready_interrupt_flag(void);
void hw_rcc_clear_pll_sai1_ready_interrupt_flag(void);
void hw_rcc_clear_pll_sai2_ready_interrupt_flag(void);
void hw_rcc_clear_css_interrupt_flag(void);
void hw_rcc_clear_lse_css_interrupt_flag(void);
void hw_rcc_set_dma1_reset(void);
void hw_rcc_wait_dma1_reset(void);
void hw_rcc_set_dma2_reset(void);
void hw_rcc_wait_dma2_reset(void);
void hw_rcc_set_flash_reset(void);
void hw_rcc_wait_flash_reset(void);
void hw_rcc_set_crc_reset(void);
void hw_rcc_wait_crc_reset(void);
void hw_rcc_set_tsc_reset(void);
void hw_rcc_wait_tsc_reset(void);
void hw_rcc_set_gpioa_reset(void);
void hw_rcc_wait_gpioa_reset(void);
void hw_rcc_set_gpiob_reset(void);
void hw_rcc_wait_gpiob_reset(void);
void hw_rcc_set_gpioc_reset(void);
void hw_rcc_wait_gpioc_reset(void);
void hw_rcc_set_gpiod_reset(void);
void hw_rcc_wait_gpiod_reset(void);
void hw_rcc_set_gpioe_reset(void);
void hw_rcc_wait_gpioe_reset(void);
void hw_rcc_set_gpiof_reset(void);
void hw_rcc_wait_gpiof_reset(void);
void hw_rcc_set_gpiog_reset(void);
void hw_rcc_wait_gpiog_reset(void);
void hw_rcc_set_gpioh_reset(void);
void hw_rcc_wait_gpioh_reset(void);
void hw_rcc_set_adc_reset(void);
void hw_rcc_wait_adc_reset(void);
void hw_rcc_set_rng_reset(void);
void hw_rcc_wait_rng_reset(void);
void hw_rcc_set_fmc_reset(void);
void hw_rcc_wait_fmc_reset(void);
void hw_rcc_set_qspi_reset(void);
void hw_rcc_wait_qspi_reset(void);
void hw_rcc_set_tim2_reset(void);
void hw_rcc_wait_tim2_reset(void);
void hw_rcc_set_tim3_reset(void);
void hw_rcc_wait_tim3_reset(void);
void hw_rcc_set_tim4_reset(void);
void hw_rcc_wait_tim4_reset(void);
void hw_rcc_set_tim5_reset(void);
void hw_rcc_wait_tim5_reset(void);
void hw_rcc_set_tim6_reset(void);
void hw_rcc_wait_tim6_reset(void);
void hw_rcc_set_tim7_reset(void);
void hw_rcc_wait_tim7_reset(void);
void hw_rcc_set_spi2_reset(void);
void hw_rcc_wait_spi2_reset(void);
void hw_rcc_set_spi3_reset(void);
void hw_rcc_wait_spi3_reset(void);
void hw_rcc_set_usart2_reset(void);
void hw_rcc_wait_usart2_reset(void);
void hw_rcc_set_usart3_reset(void);
void hw_rcc_wait_usart3_reset(void);
void hw_rcc_set_uart4_reset(void);
void hw_rcc_wait_uart4_reset(void);
void hw_rcc_set_uart5_reset(void);
void hw_rcc_wait_uart5_reset(void);
void hw_rcc_set_i2c1_reset(void);
void hw_rcc_wait_i2c1_reset(void);
void hw_rcc_set_i2c2_reset(void);
void hw_rcc_wait_i2c2_reset(void);
void hw_rcc_set_i2c3_reset(void);
void hw_rcc_wait_i2c3_reset(void);
void hw_rcc_set_can1_reset(void);
void hw_rcc_wait_can1_reset(void);
void hw_rcc_set_power_reset(void);
void hw_rcc_wait_power_reset(void);
void hw_rcc_set_dac1_reset(void);
void hw_rcc_wait_dac1_reset(void);
void hw_rcc_set_opamp_reset(void);
void hw_rcc_wait_opamp_reset(void);
void hw_rcc_set_lptim1_reset(void);
void hw_rcc_wait_lptim1_reset(void);
void hw_rcc_set_lpuart1_reset(void);
void hw_rcc_wait_lpuart1_reset(void);
void hw_rcc_set_swpmi1_reset(void);
void hw_rcc_wait_swpmi1_reset(void);
void hw_rcc_set_lptim2_reset(void);
void hw_rcc_wait_lptim2_reset(void);
void hw_rcc_set_syscfg_reset(void);
void hw_rcc_wait_syscfg_reset(void);
void hw_rcc_set_sdmmc1_reset(void);
void hw_rcc_wait_sdmmc1_reset(void);
void hw_rcc_set_tim1_reset(void);
void hw_rcc_wait_tim1_reset(void);
void hw_rcc_set_spi1_reset(void);
void hw_rcc_wait_spi1_reset(void);
void hw_rcc_set_tim8_reset(void);
void hw_rcc_wait_tim8_reset(void);
void hw_rcc_set_usart1_reset(void);
void hw_rcc_wait_usart1_reset(void);
void hw_rcc_set_tim15_reset(void);
void hw_rcc_wait_tim15_reset(void);
void hw_rcc_set_tim16_reset(void);
void hw_rcc_wait_tim16_reset(void);
void hw_rcc_set_tim17_reset(void);
void hw_rcc_wait_tim17_reset(void);
void hw_rcc_set_sai1_reset(void);
void hw_rcc_wait_sai1_reset(void);
void hw_rcc_set_sai2_reset(void);
void hw_rcc_wait_sai2_reset(void);
void hw_rcc_set_dfsdm1_reset(void);
void hw_rcc_wait_dfsdm1_reset(void);
void hw_rcc_set_dma1_clock_enable(void);
void hw_rcc_set_dma1_clock_disable(void);
uint32_t hw_rcc_get_dma1_clock_enable(void);
void hw_rcc_set_dma2_clock_enable(void);
void hw_rcc_set_dma2_clock_disable(void);
uint32_t hw_rcc_get_dma2_clock_enable(void);
void hw_rcc_set_flash_clock_enable(void);
void hw_rcc_set_flash_clock_disable(void);
uint32_t hw_rcc_get_flash_clock_enable(void);
void hw_rcc_set_crc_clock_enable(void);
void hw_rcc_set_crc_clock_disable(void);
uint32_t hw_rcc_get_crc_clock_enable(void);
void hw_rcc_set_tsc_clock_enable(void);
void hw_rcc_set_tsc_clock_disable(void);
uint32_t hw_rcc_get_tsc_clock_enable(void);
void hw_rcc_set_gpioa_clock_enable(void);
void hw_rcc_set_gpioa_clock_disable(void);
uint32_t hw_rcc_get_gpioa_clock_enable(void);
void hw_rcc_set_gpiob_clock_enable(void);
void hw_rcc_set_gpiob_clock_disable(void);
uint32_t hw_rcc_get_gpiob_clock_enable(void);
void hw_rcc_set_gpioc_clock_enable(void);
void hw_rcc_set_gpioc_clock_disable(void);
uint32_t hw_rcc_get_gpioc_clock_enable(void);
void hw_rcc_set_gpiod_clock_enable(void);
void hw_rcc_set_gpiod_clock_disable(void);
uint32_t hw_rcc_get_gpiod_clock_enable(void);
void hw_rcc_set_gpioe_clock_enable(void);
void hw_rcc_set_gpioe_clock_disable(void);
uint32_t hw_rcc_get_gpioe_clock_enable(void);
void hw_rcc_set_gpiof_clock_enable(void);
void hw_rcc_set_gpiof_clock_disable(void);
uint32_t hw_rcc_get_gpiof_clock_enable(void);
void hw_rcc_set_gpiog_clock_enable(void);
void hw_rcc_set_gpiog_clock_disable(void);
uint32_t hw_rcc_get_gpiog_clock_enable(void);
void hw_rcc_set_gpioh_clock_enable(void);
void hw_rcc_set_gpioh_clock_disable(void);
uint32_t hw_rcc_get_gpioh_clock_enable(void);
void hw_rcc_set_adc_clock_enable(void);
void hw_rcc_set_adc_clock_disable(void);
uint32_t hw_rcc_get_adc_clock_enable(void);
void hw_rcc_set_rng_clock_enable(void);
void hw_rcc_set_rng_clock_disable(void);
uint32_t hw_rcc_get_rng_clock_enable(void);
void hw_rcc_set_fmc_clock_enable(void);
void hw_rcc_set_fmc_clock_disable(void);
uint32_t hw_rcc_get_fmc_clock_enable(void);
void hw_rcc_set_qspi_clock_enable(void);
void hw_rcc_set_qspi_clock_disable(void);
uint32_t hw_rcc_get_qspi_clock_enable(void);
void hw_rcc_set_tim2_clock_enable(void);
void hw_rcc_set_tim2_clock_disable(void);
uint32_t hw_rcc_get_tim2_clock_enable(void);
void hw_rcc_set_tim3_clock_enable(void);
void hw_rcc_set_tim3_clock_disable(void);
uint32_t hw_rcc_get_tim3_clock_enable(void);
void hw_rcc_set_tim4_clock_enable(void);
void hw_rcc_set_tim4_clock_disable(void);
uint32_t hw_rcc_get_tim4_clock_enable(void);
void hw_rcc_set_tim5_clock_enable(void);
void hw_rcc_set_tim5_clock_disable(void);
uint32_t hw_rcc_get_tim5_clock_enable(void);
void hw_rcc_set_tim6_clock_enable(void);
void hw_rcc_set_tim6_clock_disable(void);
uint32_t hw_rcc_get_tim6_clock_enable(void);
void hw_rcc_set_tim7_clock_enable(void);
void hw_rcc_set_tim7_clock_disable(void);
uint32_t hw_rcc_get_tim7_clock_enable(void);
void hw_rcc_set_wwdg_clock_enable(void);
void hw_rcc_set_wwdg_clock_disable(void);
uint32_t hw_rcc_get_wwdg_clock_enable(void);
void hw_rcc_set_spi2_clock_enable(void);
void hw_rcc_set_spi2_clock_disable(void);
uint32_t hw_rcc_get_spi2_clock_enable(void);
void hw_rcc_set_spi3_clock_enable(void);
void hw_rcc_set_spi3_clock_disable(void);
uint32_t hw_rcc_get_spi3_clock_enable(void);
void hw_rcc_set_usart2_clock_enable(void);
void hw_rcc_set_usart2_clock_disable(void);
uint32_t hw_rcc_get_usart2_clock_enable(void);
void hw_rcc_set_usart3_clock_enable(void);
void hw_rcc_set_usart3_clock_disable(void);
uint32_t hw_rcc_get_usart3_clock_enable(void);
void hw_rcc_set_uart4_clock_enable(void);
void hw_rcc_set_uart4_clock_disable(void);
uint32_t hw_rcc_get_uart4_clock_enable(void);
void hw_rcc_set_uart5_clock_enable(void);
void hw_rcc_set_uart5_clock_disable(void);
uint32_t hw_rcc_get_uart5_clock_enable(void);
void hw_rcc_set_i2c1_clock_enable(void);
void hw_rcc_set_i2c1_clock_disable(void);
uint32_t hw_rcc_get_i2c1_clock_enable(void);
void hw_rcc_set_i2c2_clock_enable(void);
void hw_rcc_set_i2c2_clock_disable(void);
uint32_t hw_rcc_get_i2c2_clock_enable(void);
void hw_rcc_set_i2c3_clock_enable(void);
void hw_rcc_set_i2c3_clock_disable(void);
uint32_t hw_rcc_get_i2c3_clock_enable(void);
void hw_rcc_set_can1_clock_enable(void);
void hw_rcc_set_can1_clock_disable(void);
uint32_t hw_rcc_get_can1_clock_enable(void);
void hw_rcc_set_power_clock_enable(void);
void hw_rcc_set_power_clock_disable(void);
uint32_t hw_rcc_get_power_clock_enable(void);
void hw_rcc_set_dac1_clock_enable(void);
void hw_rcc_set_dac1_clock_disable(void);
uint32_t hw_rcc_get_dac1_clock_enable(void);
void hw_rcc_set_opamp_clock_enable(void);
void hw_rcc_set_opamp_clock_disable(void);
uint32_t hw_rcc_get_opamp_clock_enable(void);
void hw_rcc_set_lptim1_clock_enable(void);
void hw_rcc_set_lptim1_clock_disable(void);
uint32_t hw_rcc_get_lptim1_clock_enable(void);
void hw_rcc_set_lpuart1_clock_enable(void);
void hw_rcc_set_lpuart1_clock_disable(void);
uint32_t hw_rcc_get_lpuart1_clock_enable(void);
void hw_rcc_set_swpmi1_clock_enable(void);
void hw_rcc_set_swpmi1_clock_disable(void);
uint32_t hw_rcc_get_swpmi1_clock_enable(void);
void hw_rcc_set_lptim2_clock_enable(void);
void hw_rcc_set_lptim2_clock_disable(void);
uint32_t hw_rcc_get_lptim2_clock_enable(void);
void hw_rcc_set_syscfg_clock_enable(void);
void hw_rcc_set_syscfg_clock_disable(void);
uint32_t hw_rcc_get_syscfg_clock_enable(void);
void hw_rcc_set_firewall_clock_enable(void);
void hw_rcc_set_firewall_clock_disable(void);
uint32_t hw_rcc_get_firewall_clock_enable(void);
void hw_rcc_set_sdmmc1_clock_enable(void);
void hw_rcc_set_sdmmc1_clock_disable(void);
uint32_t hw_rcc_get_sdmmc1_clock_enable(void);
void hw_rcc_set_tim1_clock_enable(void);
void hw_rcc_set_tim1_clock_disable(void);
uint32_t hw_rcc_get_tim1_clock_enable(void);
void hw_rcc_set_spi1_clock_enable(void);
void hw_rcc_set_spi1_clock_disable(void);
uint32_t hw_rcc_get_spi1_clock_enable(void);
void hw_rcc_set_tim8_clock_enable(void);
void hw_rcc_set_tim8_clock_disable(void);
uint32_t hw_rcc_get_tim8_clock_enable(void);
void hw_rcc_set_usart1_clock_enable(void);
void hw_rcc_set_usart1_clock_disable(void);
uint32_t hw_rcc_get_usart1_clock_enable(void);
void hw_rcc_set_tim15_clock_enable(void);
void hw_rcc_set_tim15_clock_disable(void);
uint32_t hw_rcc_get_tim15_clock_enable(void);
void hw_rcc_set_tim16_clock_enable(void);
void hw_rcc_set_tim16_clock_disable(void);
uint32_t hw_rcc_get_tim16_clock_enable(void);
void hw_rcc_set_tim17_clock_enable(void);
void hw_rcc_set_tim17_clock_disable(void);
uint32_t hw_rcc_get_tim17_clock_enable(void);
void hw_rcc_set_sai1_clock_enable(void);
void hw_rcc_set_sai1_clock_disable(void);
uint32_t hw_rcc_get_sai1_clock_enable(void);
void hw_rcc_set_sai2_clock_enable(void);
void hw_rcc_set_sai2_clock_disable(void);
uint32_t hw_rcc_get_sai2_clock_enable(void);
void hw_rcc_set_dfsam1_clock_enable(void);
void hw_rcc_set_dfsam1_clock_disable(void);
uint32_t hw_rcc_get_dfsam1_clock_enable(void);
void hw_rcc_set_dma1sm_clock_enable(void);
void hw_rcc_set_dma1sm_clock_disable(void);
uint32_t hw_rcc_get_dma1sm_clock_enable(void);
void hw_rcc_set_dma2sm_clock_enable(void);
void hw_rcc_set_dma2sm_clock_disable(void);
uint32_t hw_rcc_get_dma2sm_clock_enable(void);
void hw_rcc_set_flashsm_clock_enable(void);
void hw_rcc_set_flashsm_clock_disable(void);
uint32_t hw_rcc_get_flashsm_clock_enable(void);
void hw_rcc_set_sram1sm_clock_enable(void);
void hw_rcc_set_sram1sm_clock_disable(void);
uint32_t hw_rcc_get_sram1sm_clock_enable(void);
