grit-li/stm32-platform-lib/src/stm32-platform/hw/hw_rcc.h
void hw_rcc_set_crcsm_clock_enable(void);
void hw_rcc_set_crcsm_clock_disable(void);
uint32_t hw_rcc_get_crcsm_clock_enable(void);
void hw_rcc_set_tscsm_clock_enable(void);
void hw_rcc_set_tscsm_clock_disable(void);
uint32_t hw_rcc_get_tscsm_clock_enable(void);
void hw_rcc_set_gpioasm_clock_enable(void);
void hw_rcc_set_gpioasm_clock_disable(void);
uint32_t hw_rcc_get_gpioasm_clock_enable(void);
void hw_rcc_set_gpiobsm_clock_enable(void);
void hw_rcc_set_gpiobsm_clock_disable(void);
uint32_t hw_rcc_get_gpiobsm_clock_enable(void);
void hw_rcc_set_gpiocsm_clock_enable(void);
void hw_rcc_set_gpiocsm_clock_disable(void);
uint32_t hw_rcc_get_gpiocsm_clock_enable(void);
void hw_rcc_set_gpiodsm_clock_enable(void);
void hw_rcc_set_gpiodsm_clock_disable(void);
uint32_t hw_rcc_get_gpiodsm_clock_enable(void);
void hw_rcc_set_gpioesm_clock_enable(void);
void hw_rcc_set_gpioesm_clock_disable(void);
uint32_t hw_rcc_get_gpioesm_clock_enable(void);
void hw_rcc_set_gpiofsm_clock_enable(void);
void hw_rcc_set_gpiofsm_clock_disable(void);
uint32_t hw_rcc_get_gpiofsm_clock_enable(void);
void hw_rcc_set_gpiogsm_clock_enable(void);
void hw_rcc_set_gpiogsm_clock_disable(void);
uint32_t hw_rcc_get_gpiogsm_clock_enable(void);
void hw_rcc_set_gpiohsm_clock_enable(void);
void hw_rcc_set_gpiohsm_clock_disable(void);
uint32_t hw_rcc_get_gpiohsm_clock_enable(void);
void hw_rcc_set_sram2sm_clock_enable(void);
void hw_rcc_set_sram2sm_clock_disable(void);
uint32_t hw_rcc_get_sram2sm_clock_enable(void);
void hw_rcc_set_otgfssm_clock_enable(void);
void hw_rcc_set_otgfssm_clock_disable(void);
uint32_t hw_rcc_get_otgfssm_clock_enable(void);
void hw_rcc_set_adcsm_clock_enable(void);
void hw_rcc_set_adcsm_clock_disable(void);
uint32_t hw_rcc_get_adcsm_clock_enable(void);
void hw_rcc_set_rngsm_clock_enable(void);
void hw_rcc_set_rngsm_clock_disable(void);
uint32_t hw_rcc_get_rngsm_clock_enable(void);
void hw_rcc_set_fmcsm_clock_enable(void);
void hw_rcc_set_fmcsm_clock_disable(void);
uint32_t hw_rcc_get_fmcsm_clock_enable(void);
void hw_rcc_set_qspism_clock_enable(void);
void hw_rcc_set_qspism_clock_disable(void);
uint32_t hw_rcc_get_qspism_clock_enable(void);
void hw_rcc_set_tim2sm_clock_enable(void);
void hw_rcc_set_tim2sm_clock_disable(void);
uint32_t hw_rcc_get_tim2sm_clock_enable(void);
void hw_rcc_set_tim3sm_clock_enable(void);
void hw_rcc_set_tim3sm_clock_disable(void);
uint32_t hw_rcc_get_tim3sm_clock_enable(void);
void hw_rcc_set_tim4sm_clock_enable(void);
void hw_rcc_set_tim4sm_clock_disable(void);
uint32_t hw_rcc_get_tim4sm_clock_enable(void);
void hw_rcc_set_tim5sm_clock_enable(void);
void hw_rcc_set_tim5sm_clock_disable(void);
uint32_t hw_rcc_get_tim5sm_clock_enable(void);
void hw_rcc_set_tim6sm_clock_enable(void);
void hw_rcc_set_tim6sm_clock_disable(void);
uint32_t hw_rcc_get_tim6sm_clock_enable(void);
void hw_rcc_set_tim7sm_clock_enable(void);
void hw_rcc_set_tim7sm_clock_disable(void);
uint32_t hw_rcc_get_tim7sm_clock_enable(void);
void hw_rcc_set_wwdgsm_clock_enable(void);
void hw_rcc_set_wwdgsm_clock_disable(void);
uint32_t hw_rcc_get_wwdgsm_clock_enable(void);
void hw_rcc_set_spi2sm_clock_enable(void);
void hw_rcc_set_spi2sm_clock_disable(void);
uint32_t hw_rcc_get_spi2sm_clock_enable(void);
void hw_rcc_set_spi3sm_clock_enable(void);
void hw_rcc_set_spi3sm_clock_disable(void);
uint32_t hw_rcc_get_spi3sm_clock_enable(void);
void hw_rcc_set_usart2sm_clock_enable(void);
void hw_rcc_set_usart2sm_clock_disable(void);
uint32_t hw_rcc_get_usart2sm_clock_enable(void);
void hw_rcc_set_usart3sm_clock_enable(void);
void hw_rcc_set_usart3sm_clock_disable(void);
uint32_t hw_rcc_get_usart3sm_clock_enable(void);
void hw_rcc_set_uart4sm_clock_enable(void);
void hw_rcc_set_uart4sm_clock_disable(void);
uint32_t hw_rcc_get_uart4sm_clock_enable(void);
void hw_rcc_set_uart5sm_clock_enable(void);
void hw_rcc_set_uart5sm_clock_disable(void);
uint32_t hw_rcc_get_uart5sm_clock_enable(void);
void hw_rcc_set_i2c1sm_clock_enable(void);
void hw_rcc_set_i2c1sm_clock_disable(void);
uint32_t hw_rcc_get_i2c1sm_clock_enable(void);
void hw_rcc_set_i2c2sm_clock_enable(void);
void hw_rcc_set_i2c2sm_clock_disable(void);
uint32_t hw_rcc_get_i2c2sm_clock_enable(void);
void hw_rcc_set_i2c3sm_clock_enable(void);
void hw_rcc_set_i2c3sm_clock_disable(void);
uint32_t hw_rcc_get_i2c3sm_clock_enable(void);
void hw_rcc_set_can1sm_clock_enable(void);
void hw_rcc_set_can1sm_clock_disable(void);
uint32_t hw_rcc_get_can1sm_clock_enable(void);
void hw_rcc_set_powersm_clock_enable(void);
void hw_rcc_set_powersm_clock_disable(void);
uint32_t hw_rcc_get_powersm_clock_enable(void);
void hw_rcc_set_dac1sm_clock_enable(void);
void hw_rcc_set_dac1sm_clock_disable(void);
uint32_t hw_rcc_get_dac1sm_clock_enable(void);
void hw_rcc_set_opampsm_clock_enable(void);
void hw_rcc_set_opampsm_clock_disable(void);
uint32_t hw_rcc_get_opampsm_clock_enable(void);
void hw_rcc_set_lptim1sm_clock_enable(void);
void hw_rcc_set_lptim1sm_clock_disable(void);
uint32_t hw_rcc_get_lptim1sm_clock_enable(void);
void hw_rcc_set_lpusart1sm_clock_enable(void);
void hw_rcc_set_lpusart1sm_clock_disable(void);
uint32_t hw_rcc_get_lpusart1sm_clock_enable(void);
void hw_rcc_set_swpmi1sm_clock_enable(void);
void hw_rcc_set_swpmi1sm_clock_disable(void);
uint32_t hw_rcc_get_swpmi1sm_clock_enable(void);
void hw_rcc_set_lptim2sm_clock_enable(void);
void hw_rcc_set_lptim2sm_clock_disable(void);
uint32_t hw_rcc_get_lptim2sm_clock_enable(void);
void hw_rcc_set_syscfgsm_clock_enable(void);
void hw_rcc_set_syscfgsm_clock_disable(void);
uint32_t hw_rcc_get_syscfgsm_clock_enable(void);
void hw_rcc_set_ssmmc1sm_clock_enable(void);
void hw_rcc_set_ssmmc1sm_clock_disable(void);
uint32_t hw_rcc_get_ssmmc1sm_clock_enable(void);
void hw_rcc_set_tim1sm_clock_enable(void);
void hw_rcc_set_tim1sm_clock_disable(void);
uint32_t hw_rcc_get_tim1sm_clock_enable(void);
void hw_rcc_set_spi1sm_clock_enable(void);
void hw_rcc_set_spi1sm_clock_disable(void);
uint32_t hw_rcc_get_spi1sm_clock_enable(void);
void hw_rcc_set_tim8sm_clock_enable(void);
void hw_rcc_set_tim8sm_clock_disable(void);
uint32_t hw_rcc_get_tim8sm_clock_enable(void);
void hw_rcc_set_usart1sm_clock_enable(void);
void hw_rcc_set_usart1sm_clock_disable(void);
uint32_t hw_rcc_get_usart1sm_clock_enable(void);
void hw_rcc_set_tim15sm_clock_enable(void);
void hw_rcc_set_tim15sm_clock_disable(void);
uint32_t hw_rcc_get_tim15sm_clock_enable(void);
void hw_rcc_set_tim16sm_clock_enable(void);
void hw_rcc_set_tim16sm_clock_disable(void);
uint32_t hw_rcc_get_tim16sm_clock_enable(void);
void hw_rcc_set_tim17sm_clock_enable(void);
void hw_rcc_set_tim17sm_clock_disable(void);
uint32_t hw_rcc_get_tim17sm_clock_enable(void);
void hw_rcc_set_sai1sm_clock_enable(void);
void hw_rcc_set_sai1sm_clock_disable(void);
uint32_t hw_rcc_get_sai1sm_clock_enable(void);
void hw_rcc_set_sai2sm_clock_enable(void);
void hw_rcc_set_sai2sm_clock_disable(void);
uint32_t hw_rcc_get_sai2sm_clock_enable(void);
void hw_rcc_set_dfsdm1sm_clock_enable(void);
void hw_rcc_set_dfsdm1sm_clock_disable(void);
uint32_t hw_rcc_get_dfsdm1sm_clock_enable(void);
void hw_rcc_select_usart1_clock_source(uint32_t source);
uint32_t hw_rcc_get_usart1_clock_source(void);
void hw_rcc_select_usart2_clock_source(uint32_t source);
uint32_t hw_rcc_get_usart2_clock_source(void);
void hw_rcc_select_usart3_clock_source(uint32_t source);
uint32_t hw_rcc_get_usart3_clock_source(void);
void hw_rcc_select_uart4_clock_source(uint32_t source);
uint32_t hw_rcc_get_uart4_clock_source(void);
void hw_rcc_select_uart5_clock_source(uint32_t source);
uint32_t hw_rcc_get_uart5_clock_source(void);
void hw_rcc_select_lpuart1_clock_source(uint32_t source);
uint32_t hw_rcc_get_lpuart1_clock_source(void);
void hw_rcc_select_i2c1_clock_source(uint32_t source);
uint32_t hw_rcc_get_i2c1_clock_source(void);
void hw_rcc_select_i2c2_clock_source(uint32_t source);
uint32_t hw_rcc_get_i2c2_clock_source(void);
void hw_rcc_select_i2c3_clock_source(uint32_t source);
uint32_t hw_rcc_get_i2c3_clock_source(void);
void hw_rcc_select_lptim1_clock_source(uint32_t source);
uint32_t hw_rcc_get_lptim1_clock_source(void);
void hw_rcc_select_lptim2_clock_source(uint32_t source);
uint32_t hw_rcc_get_lptim2_clock_source(void);
void hw_rcc_select_sai1_clock_source(uint32_t source);
uint32_t hw_rcc_get_sai1_clock_source(void);
void hw_rcc_select_sai2_clock_source(uint32_t source);
uint32_t hw_rcc_get_sai2_clock_source(void);
void hw_rcc_select_clk48_clock_source(uint32_t source);
uint32_t hw_rcc_get_clk48_clock_source(void);
void hw_rcc_select_adc_clock_source(uint32_t source);
uint32_t hw_rcc_get_adc_clock_source(void);
void hw_rcc_select_swpmi1_clock_source(uint32_t source);
uint32_t hw_rcc_get_swpmi1_clock_source(void);
void hw_rcc_select_dfsdm1_clock_source(uint32_t source);
uint32_t hw_rcc_get_dfsdm1_clock_source(void);
void hw_rcc_set_lse_clock_enable(void);
void hw_rcc_set_lse_clock_disable(void);
uint32_t hw_rcc_get_lse_clock_enable(void);
uint32_t hw_rcc_lse_clock_ready_status(void);
void hw_rcc_lse_clock_wait_ready(void);
void hw_rcc_set_lse_clock_bypass(void);
void hw_rcc_set_lse_clock_no_bypass(void);
uint32_t hw_rcc_get_lse_clock_bypass_status(void);
void hw_rcc_set_lse_clock_drive_capability(uint32_t drive);
uint32_t hw_rcc_get_lse_clock_drive_capability(void);
void hw_rcc_set_css_on_lse_clock_enable(void);
void hw_rcc_set_css_on_lse_clock_disable(void);
uint32_t hw_rcc_get_css_on_lse_clock_enable(void);
uint32_t hw_rcc_detect_css_on_lse_clock_failure_status(void);
void hw_rcc_select_rtc_clock_source(uint32_t source);
uint32_t hw_rcc_get_rtc_clock_source(void);
void hw_rcc_set_rtc_clock_enable(void);
void hw_rcc_set_rtc_clock_disable(void);
uint32_t hw_rcc_get_rtc_clock_enable(void);
void hw_rcc_set_backup_domain_reset(void);
void hw_rcc_wait_backup_domain_reset(void);
void hw_rcc_set_low_speed_clock_output_enable(void);
void hw_rcc_set_low_speed_clock_output_disable(void);
uint32_t hw_rcc_get_low_speed_clock_output_enable(void);
void hw_rcc_select_low_speed_clock_output_source(uint32_t source);
uint32_t hw_rcc_get_low_speed_clock_output_source(void);
void hw_rcc_set_lsi_clock_enable(void);
void hw_rcc_set_lsi_clock_disable(void);
uint32_t hw_rcc_get_lsi_clock_enable(void);
uint32_t hw_rcc_lsi_clock_ready_status(void);
void hw_rcc_lsi_clock_wait_ready(void);
void hw_rcc_select_msi_range_after_standby_mode(uint32_t mode);
uint32_t hw_rcc_get_msi_range_after_standby_mode(uint32_t source);
void hw_rcc_clear_reset_flag(void);
uint32_t hw_rcc_firewall_reset_flag(void);
uint32_t hw_rcc_option_byte_loader_reset_flag(void);
uint32_t hw_rcc_pin_reset_flag(void);
uint32_t hw_rcc_bor_reset_flag(void);
uint32_t hw_rcc_software_reset_flag(void);
uint32_t hw_rcc_iwatchdog_reset_flag(void);
uint32_t hw_rcc_wwatchdog_reset_flag(void);
uint32_t hw_rcc_low_power_reset_flag(void);

#ifdef __cplusplus
}
#endif

#endif